import 'package:get/get.dart';

class LocalStringsFa extends Translations {

  @override
  Map<String, Map<String, String>> get keys => {
    'fa_AF': {
      'app_name' : 'Play Bazaar',
      'notification_title' : 'Play Bazaar',


      // Games
      'games' : 'بازیها',
      'quiz': 'مسابقات آزمونی',
      'hangman': 'بازی جلاد',
      'brain_teaser' : 'چیستان',
      'games_list' : 'فهرست بازیها',
      'wall_blaster': 'دیوار شکن',
      'ludo_missions': 'لودو ماموریت',
      'enable_robots': 'فعال‌سازی ربات‌ها',
      'play_in_team': 'بازی گروهی',
      'quiz_list': 'فهرست بازی‌هایی لغتی',
      'add_question_hint' : 'بازیها به کمک شما نیاز دارد!',
      'question_hint' : 'سؤال',
      'add_question_title': 'ارسال سؤال',
      'correct_answer_hint' : 'جواب درست',
      'pick_quiz_hint' : 'به کدام آزمون اضافه شود؟',
      'question': 'سؤال',
      'your_answer': 'پاسخ شما',
      'correct_answer': 'پاسخ درست',
      'correct_answers': 'پاسخ‌های صحیح',
      'wrong_answers' : 'پاسخ های اشتباه',
      'wrong_answer' : 'پاسخ اشتباه',
      'more_information_add_quiz' : 'اطلاعات بیشتر. مثلا مناطق که استفاده میشود ...',
      'enter_your_answer_here' : 'جواب خود را اینجا وارد کنید...',
      "game_result": "نتایج بازی",
      'question_is_answered' : 'شما قبلاً به این پرسش پاسخ داده‌اید',
      'pick_an_answer' : 'سؤال انتخواب نکردی ',
      'points_earned': 'امتیازها',
      'you_can_do_better': 'آرزوی نتیجه بهتر در دور بعدی',
      'not_bad': 'تلاش خوبی بود، ادامه بده',
      'well_done': 'بهترین نتیجه!',
      'excellent': ' عالی!',
      'with_options': 'با گزینه‌',
      'without_options': 'بدون گزینه‌',
      'show_result': 'نمایش نتیجه',
      'show_the_answer': 'نمایش جواب',
      'see_result_first': 'لطفاً ابتدا نتیجه را مشاهده کنید.',
      'end_of_family_game': 'این پایان آزمون بود. Play Bazaar امیدوار است که لذت برده باشید. دکمه زیر را فشار دهید تا به لیست بازی‌ها بازگردید.',
      'you_won_conguratulation': 'شما برنده شدید! تبریک!',
      'you_lost_word_was': 'شما باختید! کلمه این بود:',
      'incorrect_guess': 'حدس اشتباه:',
      'hangman_play_settings': 'تنظیمات بازی جلاد',
      'share_game_code': 'کد را با کسانی که می‌خواهید در بازی شرکت کنند به اشتراک بگذارید',
      'deactive_other_options': 'غیرفعال کردن گزینه‌های دیگر',
      'deactive_play_with_friends': 'آیا می‌خواهید تنها بازی کنید؟ اگر بله، لطفاً دو گزینه بالا را غیرفعال کنید تا به بازی ادامه دهید',
      'add_player': 'اضافه کردن بازیکن',
      'compete_offline': 'رقابت با دوستان - آفلاین',
      'compete_online': 'رقابت با دوستان - آنلاین',
      'give_players_name': 'نام هر بازیکن را وارد کرده و "+" را فشار دهید',
      'this_generating_code': 'این یک کد تولید می‌کند که می‌توانید با دوستان خود به اشتراک بگذارید تا بپیوندند',
      'play_solo': 'تک‌نفره بازی کن',
      'play_solo_description': 'اگر تنهایی این گزینه را انتخاب کن',
      'choose_player_numbers': 'تعداد بازیکنان را انتخاب کنید',
      'players': 'بازیکن',
      'players_name_here': 'نام بازیکنان را اینجا اضافه کنید...',
      'zero_player_error': 'لطفاً حداقل دو بازیکن اضافه کنید یا گزینه‌های چندنفره را غیرفعال کنید',
      'pick_difficulty': 'سطح دشواری را انتخاب کنید',
      'add_words': 'اضافه کردن لغات',
      'add_words_label': 'کلمات را اضافه کنید و از هیچ کاراکتر ویژه یا فاصله‌ای استفاده نکنید',
      'add_words_hint': 'یک راهنما اضافه کنید',
      'guess_a_word': 'حدس یک کلمه',
      'guess_a_word_description': 'کلمه نباید فاصله اضافی، قوانین نوشتاری را نقض کند یا شامل کاراکترهای خاص باشد',
      'player_turn': 'نوبت ',
      'waiting_room': 'اتاق انتظار',
      'game_code': 'کد بازی',
      'game_code_hint': 'کد خود را اینجا وارد کنید ...',
      'waiting_start': 'در انتظار شروع میزبان...',
      'host': 'میزبان',
      'first_letter': 'شروع با حرف: ',
      'join_with_code': 'ورود با کد',
      'join_with_code_description': 'اگر یک کد برای پیوستن به دیگران دارید، این گزینه را انتخاب کنید',
      'waiting_participants': 'منتظر شرکت‌کنندگان...',
      'msg_game_destruction_succed': 'بازی با موفقیت حذف شد.',
      'msg_game_not_found': 'بازی با کد داده شده یافت نشد.',
      'msg_game_creator_deleted': 'بازی پیدا نشد، ممکن است سازنده بازی را حذف کرده باشد.',
      'game_hint_has_changed': 'راهنمای بازی تغییر کرد',
      'wordconnector': 'اتصال کلمات',
      'word_connector_settings': 'تنظیمات اتصال کلمات',
      'remember_game_level': 'سطح بازی را انتخاب کنید و سپس روی "شروع" کلیک کنید.',
      'add_letters': 'افزودن حروف',
      'add_letters_label': 'حروف ها را اضافه کرده و با کاما جدا کنید',
      'score': 'امتیاز',
      'level': 'سطح',
      'your_level': 'سطح شما',
      'reset_your_level': 'با فشار دادن دکمه پایین سطح بازی‌تان به اول برمی‌گردد، مثل روز اول.',
      'round_result': 'امتیاز در این دور: %1 امتیاز\nآیا می‌خواهید بازی‌های بیشتری انجام دهید؟',
      'waiting_players_to_finish': 'در انتظار پایان بازی سایر بازیکنان',
      'winner': 'برنده',

      //Personal information
      'name': ' نام  ',
      'lastname': ' فامیلی ',
      'email' : ' ایمیل  ',
      'password' : 'رمز ورود',
      're_password' : 'تکرار رمز ورود',
      'enter_your_password': 'رمز عبور خود را وارد کنید',
      'points': ' امتیاز  ',
      'aboutme' : 'درباره من',
      'me' : ' من  ',
      'optional' : '\\(اختیاری)',
      'status' : 'وضعیت  ',
      'online': 'فعال',
      'offline' : 'غیر فعال',

      // Group
      'private': 'خصوصی',
      'public': 'عمومی',
      'groups': 'گروه‌ها',
      'group_password_hint' : 'رمز ورود انتخاب کن ... ',
      'enter_group_password' : 'این گروه خصوصی می باشد!',
      'group_admin': 'رئیس گروه: ',
      'about_this_group' : 'درباره این گروه',
      'group': 'گروه: ',
      'creating_group_title': 'ساخت گروه',
      'creating_group_description': 'جزئیات گروه را انتخاب کنید',
      'group_password_title' : 'گروه خصوصی می باشد !',
      'enter_group_password_label' : 'رمز ورودی گروه ...',
      'group_name_hint' : 'اسم گروه...',
      'group_created' : 'گروه شما با موفقیت ثبت شد ',
      'leaving' : 'خروج',
      'number_of_members': 'تعداد اعضا',
      'group_names_valid_size' : 'نام گروه نباید خالی یا بیش از ۲۵ کاراکتر باشد',
      'group_name_unvalid_characters': 'نام گروه نباید شامل کاراکتر\'_\'باشد',
      'private_group_is_selected': 'شما یک گروه خصوصی انتخاب کرده‌اید، و یک گروه خصوصی باید رمز عبوری حداقل با ۴ کاراکتر داشته باشد',
      'you_became_a_member': 'شما عضو شدید',
      'already_member': 'قبلاً عضو شده‌اید',
      'not_group_member': 'شما عضو این گروه نیستید',
      'group_not_found': 'گروه پیدا نشد',


      // Others
      'language' : 'Languages',
      'language1': 'زبان',
      'choose_language' : 'انتخاب زبان',
      'pick_a_language': 'ابتدا یک زبان انتخاب کنید',
      'account': 'حساب کاربری',
      'farsi' : 'فارسی , دری',
      'english' : 'English',
      'requests': 'درخواست ها ',
      'my_page' : 'خانه',
      'my_chat' : 'پیامها',
      'logout' : 'خروج ',
      'my_friends': 'لیست دوستان ',
      'customize': 'شخصی‌سازی',
      'delete_friend' : 'حذف از دوستی',
      'delete_friendship': 'حذف دوستی با',
      'my_memberships' : "عضویت های من",
      'write_message_here': "پیام خود را اینجا بنویس ...",
      'search_friends' : 'جستجو به دنبال دوست جدید ...',
      'search_in_friends': 'جستجو در میان دوستان...',
      'msg_friend_not_found': 'دوستی با این نام پیدا نشد',
      'search_groups' : 'جستجو به دنبال گروه جدید ...',
      'search' : 'جستجو',
      'not_have_account' : 'تا حالا ثبت نام نیستی؟  ',
      'make_account_here' : 'اینجا ثبت نام کن  ',
      'not_valid_email' : 'یک ایمیل معتبر وارد کن لطفا',
      'your_message_here' : 'پیام خود را اینجا بنویس ...',
      'do_have_account' : 'قبلا حساب باز کردی؟ ',
      'login_from_here' : 'از اینجا وارد شو ',
      'reset_password': 'بازیابی رمز عبور',
      'enter_your_email': 'ایمیل خود را وارد کنید',
      'send_reset_link': 'ارسال لینک بازیابی',
      'reset_link_sent': 'لینک بازیابی رمز عبور ارسال شد! ایمیل خود را بررسی کنید.',
      'forgot_password': 'رمز عبور خود را فراموش کرده‌اید؟',
      'received_requests' : 'درخواست های دریافتی',
      'description' : 'توضیحات',
      'no_description' : 'توضیحات وجود ندارد ',
      'path': 'درخواست اضافه شدن به بازی',
      'request_cancelled': 'درخواست لغو شد',
      'request_sent': 'درخواست ارسال شد',
      'search_not_found': 'داده‌ای با این پارامتر جستجو یافت نشد',
      'details': 'جزئیات',
      'select' : 'انتخاب کنید',
      'sounds': 'صداها',
      'say_hi': 'سلام کن به',
      'guide': 'راهنما',
      'danger_zone': 'منطقه خطر',
      'write_here': 'اینجا بنویسید...',
      'copy': 'کپی',
      'copied_to_clipboard': 'کد در کلیپ‌بورد کپی شد: ',
      'current_data': 'داده‌های فعلی',
      'words': 'کلمات',
      'letters': 'حروف',
      'empty_field': 'فیلد خالی است',
      'word_already_exist': 'این کلمه قبلاً وجود دارد',
      'nothing_to_save': 'چیز جدیدی برای ذخیره وجود ندارد',
      'max_level_100': 'سطح باید کمتر از ۱۰۰ و بزرگتر از ۰ باشد',
      'yes': 'بله',
      'no': 'خیر',
      'computer': 'کامپیوتر',


      // Friends
      'friends' : 'دوستان',
      'empty_friend_list': 'شما هنوز دوستی ندارید',
      'friend_request': 'درخواست دوستی',
      'friends_messages': 'پیام از طرف دوستان',


      // Buttons
      'btn_chats' : 'پیام‌ها',
      'btn_home': 'خانه',
      'btn_cancel': 'لغو',
      'btn_create': 'ثبت کن',
      'btn_login' : 'ورود',
      'btn_membership_request' : 'درخواست عضویت',
      'btn_accept' : 'تایید',
      'btn_decline': 'رد کن ',
      'btn_leaving_group': 'ترک گروه',
      'btn_edit' : 'ویرایش',
      'btn_save' : 'ذخیره',
      'btn_next' : 'سوال بعدی',
      'btn_result' : 'نتایج بازی',
      'btn_send_question' : 'ارسال سؤال',
      'btn_send' : 'ارسال',
      'btn_continue' : 'ادامه',
      'btn_review' : 'بازبینی',
      'btn_approve' : 'تایید',
      'btn_reject' : 'رد کن',
      'btn_resent' : 'ارسال مجدد ایمیل',
      'btn_sounds': 'صدای دکمه ها',
      'btn_awaiting_response': 'در انتظار پاسخ',
      'btn_approve_request': 'قبول درخواست',
      'btn_cancel_request': 'لغو درخواست',
      'btn_request_friendship' : 'درخواست دوستی',
      'btn_restart': 'راه‌اندازی مجدد',
      'btn_ok': 'باشه',
      'btn_delete_account': 'حذف حساب',
      'btn_new_game': 'بازی جدید',
      'btn_start': 'شروع',
      'btn_send_words': 'کلمات را برای ما ارسال کنید',
      'btn_leave': 'ترک',
      'btn_add': 'افزودن',
      'btn_update': 'به‌روزرسانی',
      'btn_remove': 'حذف',
      'btn_reset': 'بازگشت به اول',


      //  Settings
      'settings': 'تنظیمات',


      // Notifcation - generall
      'notification': 'پیام',
      'notifications' : 'پیامک ها',
      'question_added' : 'سوال شما با موفقیت ثبت شد',
      'question_added_to_quiz' : 'سوال با موفقیت ثبت شد',
      'quetion_added_title': 'موفقیت',
      'fill_all_input' : 'خانه که مربوط به سوال و جواب ها هست باید پر شود',
      'fill_all_input_title': 'فرستادن سؤال',


      // Snackbar Message
      'leaving_group': 'مطمئن هستی از اینکه گروه را ترک میکنی؟',
      'leaving_group_succed' : 'با موفقیت از گروه خارج شدی',
      'group_membership_succed' : 'با موفقیت عضو گروه شدی',
      'leaving_group_failed' : 'به دلیل بروز خطا، امکان حذف شما از گروه وجود نداشت. لطفاً دوباره تلاش کنید',
      'group_membership_failed' : 'به دلیل بروز خطا، امکان اضافه کردن شما به گروه وجود نداشت. لطفاً دوباره تلاش کنید',
      'not_found_title' : 'شما در هیچ گروهی عضویت نداری!',
      'not_found_message': ' ۱: دکمه پایین سمت چپ (+) را برای ایجاد گروه خودت فشار بده  \n ۲: علامت جستجو بالا سمت چپ را برای جستجوی گروه که دیگران ایجاد کرده فشار بده',
      'friend_notfound': 'کاربری با این نام پیدا نشد!',
      'registration_succed': 'ثبت نام شما با موفقیت انجام شد',
      'authentication_failed' : 'حراز هویت ناموفق بود. لطفاً دوباره تلاش کنید',
      'unexpected_result' : 'اتفاق غیر منتظره رخ داد, لطفا دوباره تلاش کن',
      'restart_app_fail': 'به دلیل یک خطای غیرمنتظره، لطفاً برنامه را ببندید و دوباره راه‌اندازی کنید',
      'members_notfound' : 'هیچ عضوی  پیدا نشد',
      'name_is_required' : 'وارد کردن نام ضروری است!',
      'approved_friend_request': 'درخواست دوستی شما پذیرفته شد ',
      'declined_friend_request' : 'درخواست دستی شما را رد کرد',
      'received_friend_request_body': 'دریافت درخواست جدید از طرف',
      'received_friend_request_title': 'درخواست دوستی جدید',
      'removed_from_friends' : 'از لیست دوستان شما حذف شد',
      'something_went_wrong' : 'خطایی رخ داد, لطفا دوباره تلاش کنید',
      'wrong_group_password' : 'رمز را که وارد کردید اشتباه بود!',
      'email_exist' : 'ایمیل وارد شده قبلا استفاده شده. اگر رمز ورود خود را فراموش کرده اید درخواست رمزجدید نمایید لطفا!',
      'too_weak_password': 'رمز ورود شما ضعیف است. لطفا رمز قوی تری متشکل از آلفبای کوچک, بزرک و شماره وارد کنید!',
      'user_not_found' : 'کاربر با این مشخصات یافت نشد, لطفا ایمیل و پسورد خودرا چک کنید!',
      'too-many-requests': 'تعداد دفعات تلاش برای ورود بیش از حد است. لطفاً بعداً دوباره تلاش کنید.',
      'verification_email_sent': 'ایمیل تأیید ارسال شد. ایمیل خود را باز کرده و حساب خدرا تایید کنید!',
      'reassign_text': 'آیا ایمیل خود را به اشتباه وارد کرده‌اید؟ روی دکمه زیر کلیک کنید.',
      'signed_as' : 'ورود با آدرس ',
      'verify_email_counter' : 'به دلایل امنیتی، لطفاً ایمیل خود را ظرف ۲۴ ساعت تأیید کنید. در غیر این صورت، حساب کاربری شما به صورت دائمی حذف خواهد شد!',
      'verify_email_title' : 'ایمیل خود را تأیید کنید',
      'check_your_inbox' : 'لطفاً وارد ایمیل خود شوید و روی لینک تایید فشار بده',
      'invalid_email_format' : 'فرمت ایمیل نامعتبر می باشد',
      'different_password' : 'رمز اول و دوم باید یکی باشد',
      'no_review_questions' : 'درخواستی وجود ندارد ',
      'account_removed_not_verifying_email': 'حساب کاربری شما به دلیل عدم تأیید ایمیل به طور دائم حذف شده است',
      'account_removed_permanantly' : 'حساب کاربری شما به طور دائم حذف شده است',
      'relogin_to_delete_your_account' : 'برای حذف حساب کاربری خود، لطفاً دوباره وارد شوید تا هویت خود را تأیید کنید.',
      'didnt_made_changes' : 'شما هیچ تغییری برای ذخیره کردن انجام نداده‌اید',
      'your_changes_succed' : 'اطلاعات شما با موفقیت تغییر یافت',
      'account_succed_but_info_failed' : 'حساب شما ایجاد شده است، اما نام و نام خانوادگی شما ذخیره نشد. لطفاً از طریق گزینه ویرایش آن را اضافه کنید',
      'delete_account_guidance': 'حذف حساب شما تمام داده‌های شما را به طور دائمی حذف کرده و بلافاصله اجرا می‌شود. این اقدام غیرقابل برگشت است. اگر روزی بخواهید برگردید، باید یک حساب جدید ایجاد کنید.',
      'delete_account_warning': 'آیا مطمئن هستید که می‌خواهید حساب خود را به طور دائمی حذف کنید؟',
      'delete_account_reauth_description': 'برای ادامه حذف حساب، لطفاً رمز عبور فعلی خود را وارد کنید. اگر رمز عبور خود را فراموش کرده‌اید، لطفاً از حساب خود خارج شوید و روی لینک "فراموشی رمز عبور" در صفحه ورود کلیک کنید تا آن را تغییر دهید.',
      'account_deletion_succed': 'حساب شما با موفقیت حذف شد.',
      'change_path' : 'مسیر را از زیر تغییر دهید',
      'error_while_sending_message': 'پیام شما ارسال نشد. دوباره تلاش کنید!',
      'allowed_message_length_1000' : 'لطفاً پیام خود را به کمتر از ۱۰۰۰ کاراکتر محدود کنید',
      'allowed_message_length_300' : 'لطفاً پیام خود را به کمتر از ۳۰۰ کاراکتر محدود کنید',
      'current_message_length' : 'طول فعلی پیام',
      'reached_start_of_conversation': 'به ابتدای گفتگو رسیده‌اید',
      'auto_destractor_message': 'پیام‌ها به طور خودکار پس از ۵ روز حذف می‌شوند',
      'chat_creation_failed': 'ایجاد چت ناموفق بود',
      'failed_to_accept_friend_request': 'قبول درخواست دوستی ناموفق بود',
      'adding_word_succed': 'افزودن کلمات جدید با موفقیت انجام شد',


      // سیاست حفظ حریم خصوصی
      'policy_title': 'حریم خصوصی',
      'policy_introduction_title': 'سیاست حفظ حریم خصوصی',
      'policy_introduction_description': 'دربازار بازی، ما به حریم خصوصی شما اولویت می‌دهیم و متعهد به تأمین امنیت اطلاعات شخصی شما هستیم. این سیاست حفظ حریم خصوصی توضیح می‌دهد که چگونه اطلاعات شما را هنگام استفاده از اپلیکیشن ما مدیریت، ذخیره و محافظت می‌کنیم.',

      'policy_info_collection_title': 'جمع‌آوری و ذخیره اطلاعات',
      'policy_info_collection_description': 'وقتی از اپلیکیشن بازار بازی استفاده می‌کنید، ممکن است برخی از اطلاعات شخصی شما، شامل نام، آدرس ایمیل و سایر جزئیات مورد نیاز برای ایجاد حساب کاربری و عملکرد اپلیکیشن را جمع‌آوری کنیم. تمام اطلاعات جمع‌آوری‌شده به‌صورت امن در پایگاه داده ما ذخیره می‌شود که توسط Firestore، یک سرویس ابری متعلق به گوگل، میزبانی می‌شود.',

      'policy_data_security_and_thirdparty_title': 'امنیت داده‌ها و دسترسی به اشخاص ثالث',
      'policy_data_security_and_thirdparty_description_part1': 'ما اطلاعات شخصی شما را با هیچ شرکت ثالثی به اشتراک نمی‌گذاریم، نمی‌فروشیم و توزیع نمی‌کنیم. اطلاعات شما تنها برای ارائه خدمات از طریق اپلیکیشن بازار بازی استفاده می‌شود. داده‌های شما در سرورهای فایربیس در فرانکفورت، آلمان ذخیره می‌شود.',
      'policy_data_security_and_thirdparty_description_part2': 'در حالی که اطلاعات شما در Firestore ذخیره می‌شود که متعلق به گوگل است، این به معنای آن نیست که گوگل مجاز به استفاده از اطلاعات شخصی شما برای هر هدفی غیرمرتبط با اپلیکیشن ما باشد. گوگل مسئولیت حفظ امنیت خدمات ابری خود را بر عهده دارد و ما اطمینان می‌دهیم که اطلاعات شما بر اساس تدابیر امنیتی سختگیرانه گوگل محافظت می‌شود.',

      'policy_forbidden_usage_title': 'شرایط استفاده',
      'policy_forbidden_usage_description': '''در Play Bazaar، ما تلاش می‌کنیم تا تجربه‌ای عالی برای کاربران خود فراهم کنیم و یک جامعه امن، محترمانه و لذت‌بخش ایجاد کنیم. برای حفظ این استاندارد، قوانین خاصی برای استفاده از گروه‌ها و پیام‌های خصوصی وضع شده است.  
هرگونه سخنان نفرت‌آمیز، تبعیض، آزار و اذیت، یا به اشتراک‌گذاری محتوای توهین‌آمیز یا نامناسب به شدت ممنوع است. بحث‌هایی که شامل نژادپرستی، جنسیت‌گرایی یا موضوعات حساس باشند، می‌تواند به پیامدهایی مانند محدودیت موقت یا دائمی برای شرکت در گروه‌ها یا ارسال پیام‌های خصوصی منجر شود.       
       با استفاده از این قابلیت‌ها، شما موافقت می‌کنید که به این قوانین پایبند باشید و به ایجاد یک محیط مثبت و محترمانه برای همه کمک کنید.''',

      'policy_agreement_title': 'موافقت با سیاست حفظ حریم خصوصی',
      'policy_agreement_description': 'با استفاده از اپلیکیشن Play Bazaar، شما این سیاست حفظ حریم خصوصی را تأیید و قبول می‌کنید. سرورهای Firebase که در یک کشور اروپایی قرار دارند برای پردازش داده‌ها استفاده می‌شوند. ما شما را تشویق می‌کنیم که این سیاست را به طور منظم بررسی کنید، زیرا استفاده مستمر از اپ نشان‌دهنده پذیرش هرگونه تغییر یا به‌روزرسانی است.',

      'policy_updates_title': 'به‌روزرسانی سیاست‌ها',
      'policy_updates_description': 'ما حق داریم هر زمان این سیاست حفظ حریم خصوصی را به‌روزرسانی یا اصلاح کنیم. هرگونه تغییرات ایجاد شده در این صفحه منعکس خواهد شد و ادامه استفاده شما از اپلیکیشن به معنای موافقت شما با این تغییرات است.',

      // تماس با ما
      'contact_us_title': 'تماس با ما',
      'contact_us_description': 'اگر سوال یا نگرانی در مورد این سیاست حفظ حریم خصوصی دارید، لطفاً با ما از طریق kh.techn@gmail.com تماس بگیرید.',


      // Long message
      'empty_quizz_message' : 'این بازی در حال حاضر فاقد کلمات است و ما به کمک شما نیاز داریم. لطفاً به صفحه قبلی برگردید و در پایین صفحه دکمه «ارسال سؤال» را فشار دهید و کلماتی که می‌خواهید به این بازی اضافه شوند را برای ما ارسال کنید. از لطف و زحمات شما سپاسگزاریم',
      'email_verification_intro' : 'به Play Bazaar خوش آمدید! یک ایمیل تایید به ایمیل شما ارسال شده است. لطفاً ایمیل خود را تایید کنید تا فرآیند تکمیل شود. ما هر عضو را در Play Bazaar تایید می‌کنیم تا اطمینان حاصل کنیم که پلتفرم ما فضایی امن است که در آن هر کاربر یک انسان واقعی است.',

      'quiz_play_guide': '''
        بازی‌های لغتی فعلاً شما را یا مستقیماً به صفحه بازی هدایت می‌کند و یا از شما می‌خواهد که انتخاب کنید "با گزینه" یا "بدون گزینه" می‌خواهید بازی کنید. در زیر هر دو شرایط برای شما توضیح داده شده است.
        
        **با گزینه**
        اگر انتخاب شما "با گزینه" باشد، این انتخاب برای هر سؤال چهار گزینه دارد که باید یکی از جواب‌ها را انتخاب کنید تا به سؤال بعدی بروید. پس از ۱۰ سؤال، نتایج نمایش داده می‌شود و امتیازاتی که کسب کرده‌اید مشخص خواهد شد.
        ۱. هر پاسخ درست ۳ امتیاز
        ۲. هر پاسخ اشتباه ۱ امتیاز منفی
        
        **بدون گزینه**
        اگر در جمع دوستان نشسته‌اید و به سرگرمی نیاز دارید، این گزینه مخصوص شماست. در اینجا سؤال به شما نمایش داده می‌شود تا همه نظر خود را بگویند. پس از اینکه همه نظرشان را گفتند، دکمه "نمایش جواب" را فشار دهید تا پاسخ درست مشخص شود. در این گزینه، دادن امتیاز به عهده خود شماست.
        ''',

        'notification_permission_description': '''لطفاً به ما اجازه دهید تا در صورت دریافت پیام خصوصی از دوستان، درخواست دوستی یا پیشنهادات ویژه از Play Bazaar به شما اطلاع دهیم. شما همیشه می‌توانید این اجازه را لغو کنید یا برای سرویس‌های خاصی در تنظیمات ارسال اعلان را غیرفعال کنید.''',

      // Hangman
      'hangman_settings_title': 'صفحه تنظیمات بازی جلاد',
      'hangman_settings_description': '''
        در این بخش، کاربران می‌توانند نوع بازی را انتخاب کنند. گزینه‌های موجود عبارتند از:
        
        بازی تک‌نفره:
        در این حالت، سیستم به‌صورت خودکار یک کلمه را از پایگاه داده انتخاب می‌کند و کاربر باید آن را حدس بزند.
        
        رقابت با دوستان - آفلاین:
        کاربران ابتدا باید نام بازیکنان را وارد کنند و با زدن دکمه "+"، نام آن‌ها به لیست اضافه می شود.
        پس از وارد کردن تمام نام‌ها، دکمه "شروع" را فشار دهید تا بازی آغاز شود.
        سیستم به‌صورت نوبتی یکی از بازیکنان را برای انتخاب کلمه مشخص می‌کند و سایر بازیکنان باید آن کلمه را حدس بزنند.
        
        رقابت با دوستان - آنلاین:
        اگر کاربر "آنلاین" را فعال کند، سیستمی یک کد تولید می‌کند که باید برای دوستان ارسال شود.
        دوستان با وارد کردن کد در بخش "ورود با کد" می‌توانند به بازی بپیوندند.
        سازنده بازی بازی را شروع می‌کند و هدف این است که هرکس سریع‌تر کلمه را پیدا کند، برنده بازی شود.
        '''.split('\n') // Split the string by lines
          .map((line) => line.trim()) // Remove leading and trailing spaces from each line
          .join('\n') // Rejoin the lines into a string
          .trim(), // Remove any extra spaces from the start and end of the entire string,

      'play_rules_title': 'قوانین بازی',
      'play_rules_description': '''
        قانون ساده است: شما باید کلمه مخفی را پیدا کنید. شما دو راهنما دارید:
        
        1. راهنما اول نشان می‌دهد که کلمه مخفی متعلق به چه دسته‌ای است.
        2. راهنما دوم اولین حرف از کلمه را نشان می‌دهد.
        
        شما ۶ فرصت دارید که اشتباه کنید. با هر اشتباه، بخشی از بدن شما روی چوبه دار آویزان می‌شود. شما باید قبل از اینکه بدن کامل شما آویزان شود، کلمه را پیدا کنید.
        
        نکات:
        اگر هیچ ایده‌ای درباره کلمه ندارید، به دسته‌بندی فکر کنید و به این که کدام حروف بیشتر در آن دسته استفاده می‌شوند. سعی کنید حرفی را انتخاب کنید که بیشتر استفاده می‌شود.
      '''.split('\n') // Split the string by lines
          .map((line) => line.trim()) // Remove leading and trailing spaces from each line
          .join('\n') // Rejoin the lines into a string
          .trim(), // Remove any extra spaces from the start and end of the entire string


      // Word connector
        'word_connector_play_rules': 'وقتی بازی را شروع می‌کنید، لیستی از کلمات مخفی در بالای صفحه نمایش داده می‌شود. طول هر کلمه با توجه به تعداد جعبه‌های موجود در ردیف تعیین می‌شود. در پایین صفحه، حروفی را مشاهده خواهید کرد که می‌توانید برای پیدا کردن کلمات مخفی از آن‌ها استفاده کنید. باید تمام کلمات مخفی را پیدا کنید تا به مرحله بعد بروید. فراموش نکنید که قبل از شروع بازی یک سطح انتخاب کنید.',

      // Ludo
      'ludo_home_screen_guide_title': 'راهنمای صفحه اصلی لودو',
       'ludo_home_screen_guide': 'صفحه اصلی چهار گزینه برای انتخاب ارائه می‌دهد: ۲، ۳ و ۴ بازیکن که نمایانگر تعداد شرکت‌کنندگان است. اگر کمتر از چهار نفر هستید، می‌توانید گزینه \'فعال‌سازی ربات‌ها\' را انتخاب کنید تا مکان‌های خالی پر شوند. در غیر این صورت، اگر تنها بازی می‌کنید و می‌خواهید مقابل کامپیوتر بازی کنید، می‌توانید گزینه \'کامپیوتر\' را انتخاب کنید بدون اینکه نیازی به فعال‌سازی ربات‌ها باشد.\n\n گزینه دیگر \'بازی گروهی\'است. با انتخاب این گزینه هر گروه شامل ۲ بازیکن میشود که برای برنده شدن باید گروه رقیب را شکست دهد.\n\n لطفاً توجه داشته باشید که بازی آنلاین فعلاً در دسترس نیست، زیرا هنوز در حال تکمیل نسخه آنلاین هستیم. ما در تلاشیم تا مسابقات آنلاین را در اسرع وقت ارائه دهیم، بنابراین از شما خواهش می‌کنیم که صبور باشید.'
    }
  };

}